api/app/models/transaction.rb

    def apply_rules
      Rule.all.each do |rule|
---
SELECT "rules".* FROM "rules"