api/app/controllers/api/v1/transactions_controller.rb

      def index
        @transactions = ::Transaction.includes(:category, :applied_rules)
                                   .order(date: :desc)
                                   .page(params[:page])
                                   .per(params[:per_page] || 100)
---
SELECT COUNT(*) FROM "transactions"
SELECT "transactions".* FROM "transactions" ORDER BY "transactions"."date" DESC LIMIT 100 OFFSET 0

      def create
        @transaction = ::Transaction.new(transaction_params)

        if @transaction.save
---
INSERT INTO "transactions" ("date", "description", "amount", "category_id", "flagged", "metadata", "created_at", "updated_at") VALUES ('2025-04-23', 'Grocery shopping', 50.25, NULL, FALSE, '{}', '2025-04-24 06:47:36.541292', '2025-04-24 06:47:36.541292') RETURNING "id"