api/app/services/rule_application_service.rb

    def self.apply_rules_to_transaction(transaction)
      # Only proceed if rules exist and category is not already set
      return unless Rule.exists? && transaction.category_id.nil?

      # Get all rules, ordered by priority if the column exists
      rules = if Rule.column_names.include?('priority')
---
SELECT 1 AS one FROM "rules" LIMIT 1
SELECT "rules".* FROM "rules" ORDER BY "priority" DESC